[S_Broadcast_Truth_Advent_Speaker_01 AkEvent]
SpokenText="Fellow citizens.  For 20 years we have put our trust in ADVENT, in the Elders - because we believed a better future is possible for all.  Today, that trust, that belief, has been rewarded."

[S_Broadcast_Truth_Advent_Speaker_02 AkEvent]
SpokenText="ADVENT peacekeeping forces are traveling across the world carrying the greatest gift from the elders."

[S_Broadcast_Truth_Advent_Speaker_03 AkEvent]
SpokenText="A revolutionary gene therapy yes.  But so much more.  This is an end to to disease.  To decay.  To pain.  The beginnings of a new tomorrow.  Available to all of us.  Today."

[S_Broadcast_Truth_Advent_Speaker_04 AkEvent]
SpokenText="Truly humanity finally takes its rightful place amongst the stars."

[S_Game_Over_Advent_Speaker_01 AkEvent]
SpokenText="Loyal citizens - I stand before you truly humbled.  So many lives lost, so many needless sacrifices endured, as we've struggled to cope with those who would see our great coalition fall.  Today, our struggle ends."

[S_Game_Over_Advent_Speaker_02 AkEvent]
SpokenText="XCOM is no more."

[S_Game_Over_Advent_Speaker_03 AkEvent]
SpokenText="ADVENT Peacekeepers have reduced the last of their strongholds to ashes.  And with it, the fragmented remains of the old world are finally washed away."

[S_Game_Over_Advent_Speaker_04 AkEvent]
SpokenText="Thank you for your continued support.  And thank you to the Elders for their guidance through this crisis."

[S_Game_Over_Advent_Speaker_05 AkEvent]
SpokenText="Long live Advent.  Long Live the Elders."

[S_Intro_Advent_Speaker_01 AkEvent]
SpokenText="A small number of dissidents again repeat the mistakes of the old world.  Striking as we celebrate a benevolent savior who time and again offers only friendship and compassion.  Yet these trivial actions could never break the bond between humanity and the Elders..."

[S_Liberation_Network_One_Speaker_01 AkEvent]
SpokenText="A better life is possible. Embrace the wisdom of the Elders and cast off the filth and decay of the old world. Join ADVENT. Join the Elders. Help build a better future for... "

[S_Retaliation_Advent_Spokesman_01_Setup_Phase AkEvent]
SpokenText="Fellow citizens.  For 20 years the ADVENT Coalition has worked tirelessly to repair the ravages and injustices of the old world.  Under our stewardship, our cities prosper, our people flourish, and our world heals."

[S_Retaliation_Advent_Spokesman_02_Setup_Phase AkEvent]
SpokenText="And yet among us there are still those who would refuse to acknowledge the truth! Dissidents who strike from the shadows of the rot and ruin outside our walls.  Who are determined to see all that we have achieved crumble!"

[S_Retaliation_Advent_Spokesman_03_Setup_Phase AkEvent]
SpokenText="That must end. Which is why...even as I speak to you today, ADVENT peacekeepers are advancing into the outlying territories to end this scourge once and for all.  We will ensure your continued safety and well-being throughout this crisis."

[S_Retaliation_Advent_Spokesman_04_Setup_Phase AkEvent]
SpokenText="With your cooperation, we will overcome these radical elements..."

[S_Retaliation_Advent_Spokesman_05_Setup_Phase AkEvent]
SpokenText="...And usher in another 20 years of peace and prosperity"

